tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Shell plugin manager
brew "antibody"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Platform built on V8 to build network applications
brew "node"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Management tool for Unity
cask "unity-hub"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "카카오톡", id: 869223134
